loadtest-refresh-post-redis-tuning-results.txt
C:/Users/xsaad/Documents/authforge/.tools/k6-v0.54.0-windows-amd64/k6.exe run loadtest/k6/refresh_rotation.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest/k6/refresh_rotation.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 55s max duration (incl. graceful stop):
              * concurrent_refresh: 10 looping VUs for 45s (gracefulStop: 10s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
concurrent_refresh   [   2% ] 10 VUs  01.0s/45s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
concurrent_refresh   [   4% ] 10 VUs  02.0s/45s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
concurrent_refresh   [   7% ] 10 VUs  03.0s/45s

running (04.0s), 10/10 VUs, 5 complete and 0 interrupted iterations
concurrent_refresh   [   9% ] 10 VUs  04.0s/45s

running (05.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
concurrent_refresh   [  11% ] 10 VUs  05.0s/45s

running (06.0s), 10/10 VUs, 9 complete and 0 interrupted iterations
concurrent_refresh   [  13% ] 10 VUs  06.0s/45s

running (07.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
concurrent_refresh   [  16% ] 10 VUs  07.0s/45s

running (08.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
concurrent_refresh   [  18% ] 10 VUs  08.0s/45s

running (09.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
concurrent_refresh   [  20% ] 10 VUs  09.0s/45s

running (10.0s), 10/10 VUs, 15 complete and 0 interrupted iterations
concurrent_refresh   [  22% ] 10 VUs  10.0s/45s

running (11.0s), 10/10 VUs, 17 complete and 0 interrupted iterations
concurrent_refresh   [  24% ] 10 VUs  11.0s/45s

running (12.0s), 10/10 VUs, 18 complete and 0 interrupted iterations
concurrent_refresh   [  27% ] 10 VUs  12.0s/45s

running (13.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
concurrent_refresh   [  29% ] 10 VUs  13.0s/45s

running (14.0s), 10/10 VUs, 24 complete and 0 interrupted iterations
concurrent_refresh   [  31% ] 10 VUs  14.0s/45s

running (15.0s), 10/10 VUs, 24 complete and 0 interrupted iterations
concurrent_refresh   [  33% ] 10 VUs  15.0s/45s

running (16.0s), 10/10 VUs, 25 complete and 0 interrupted iterations
concurrent_refresh   [  36% ] 10 VUs  16.0s/45s

running (17.0s), 10/10 VUs, 26 complete and 0 interrupted iterations
concurrent_refresh   [  38% ] 10 VUs  17.0s/45s

running (18.0s), 10/10 VUs, 28 complete and 0 interrupted iterations
concurrent_refresh   [  40% ] 10 VUs  18.0s/45s

running (19.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
concurrent_refresh   [  42% ] 10 VUs  19.0s/45s

running (20.0s), 10/10 VUs, 31 complete and 0 interrupted iterations
concurrent_refresh   [  44% ] 10 VUs  20.0s/45s

running (21.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
concurrent_refresh   [  47% ] 10 VUs  21.0s/45s

running (22.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
concurrent_refresh   [  49% ] 10 VUs  22.0s/45s

running (23.0s), 10/10 VUs, 38 complete and 0 interrupted iterations
concurrent_refresh   [  51% ] 10 VUs  23.0s/45s

running (24.0s), 10/10 VUs, 41 complete and 0 interrupted iterations
concurrent_refresh   [  53% ] 10 VUs  24.0s/45s

running (25.0s), 10/10 VUs, 44 complete and 0 interrupted iterations
concurrent_refresh   [  56% ] 10 VUs  25.0s/45s

running (26.0s), 10/10 VUs, 46 complete and 0 interrupted iterations
concurrent_refresh   [  58% ] 10 VUs  26.0s/45s

running (27.0s), 10/10 VUs, 46 complete and 0 interrupted iterations
concurrent_refresh   [  60% ] 10 VUs  27.0s/45s

running (28.0s), 10/10 VUs, 49 complete and 0 interrupted iterations
concurrent_refresh   [  62% ] 10 VUs  28.0s/45s

running (29.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
concurrent_refresh   [  64% ] 10 VUs  29.0s/45s

running (30.0s), 10/10 VUs, 54 complete and 0 interrupted iterations
concurrent_refresh   [  67% ] 10 VUs  30.0s/45s

running (31.0s), 10/10 VUs, 54 complete and 0 interrupted iterations
concurrent_refresh   [  69% ] 10 VUs  31.0s/45s

running (32.0s), 10/10 VUs, 55 complete and 0 interrupted iterations
concurrent_refresh   [  71% ] 10 VUs  32.0s/45s

running (33.0s), 10/10 VUs, 56 complete and 0 interrupted iterations
concurrent_refresh   [  73% ] 10 VUs  33.0s/45s

running (34.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
concurrent_refresh   [  76% ] 10 VUs  34.0s/45s

running (35.0s), 10/10 VUs, 61 complete and 0 interrupted iterations
concurrent_refresh   [  78% ] 10 VUs  35.0s/45s

running (36.0s), 10/10 VUs, 62 complete and 0 interrupted iterations
concurrent_refresh   [  80% ] 10 VUs  36.0s/45s

running (37.0s), 10/10 VUs, 66 complete and 0 interrupted iterations
concurrent_refresh   [  82% ] 10 VUs  37.0s/45s

running (38.0s), 10/10 VUs, 66 complete and 0 interrupted iterations
concurrent_refresh   [  84% ] 10 VUs  38.0s/45s

running (39.0s), 10/10 VUs, 67 complete and 0 interrupted iterations
concurrent_refresh   [  87% ] 10 VUs  39.0s/45s

running (40.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
concurrent_refresh   [  89% ] 10 VUs  40.0s/45s

running (41.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
concurrent_refresh   [  91% ] 10 VUs  41.0s/45s

running (42.0s), 10/10 VUs, 71 complete and 0 interrupted iterations
concurrent_refresh   [  93% ] 10 VUs  42.0s/45s

running (43.0s), 10/10 VUs, 73 complete and 0 interrupted iterations
concurrent_refresh   [  96% ] 10 VUs  43.0s/45s

running (44.0s), 10/10 VUs, 78 complete and 0 interrupted iterations
concurrent_refresh   [  98% ] 10 VUs  44.0s/45s

running (45.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
concurrent_refresh   [ 100% ] 10 VUs  45.0s/45s

running (46.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
concurrent_refresh ↓ [ 100% ] 10 VUs  45s

running (47.0s), 08/10 VUs, 82 complete and 0 interrupted iterations
concurrent_refresh ↓ [ 100% ] 10 VUs  45s

     ✓ issued refresh token
     ✓ refresh status 200 or 400

     checks.........................: 100.00% 540 out of 540
     data_received..................: 1.2 MB  25 kB/s
     data_sent......................: 434 kB  9.1 kB/s
     http_req_blocked...............: avg=1.51ms   min=0s      med=0s       p(90)=0s      p(95)=18.33ms p(99)=54.21ms  max=56.13ms
     http_req_connecting............: avg=1.13ms   min=0s      med=0s       p(90)=0s      p(95)=18.33ms p(99)=23.25ms  max=23.87ms
     http_req_duration..............: avg=794.11ms min=30.33ms med=604.13ms p(90)=1.89s   p(95)=2.44s   p(99)=3.12s    max=3.88s  
       { expected_response:true }...: avg=688.75ms min=30.33ms med=496.07ms p(90)=1.75s   p(95)=2.47s   p(99)=3.16s    max=3.88s  
     http_req_failed................: 40.00%  360 out of 900
     http_req_receiving.............: avg=18.77ms  min=0s      med=2.61ms   p(90)=12.81ms p(95)=54.97ms p(99)=573.11ms max=1.07s  
     http_req_sending...............: avg=46.79µs  min=0s      med=0s       p(90)=0s      p(95)=509.7µs p(99)=615.44µs max=5.21ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       p(90)=0s      p(95)=0s      p(99)=0s       max=0s     
     http_req_waiting...............: avg=775.29ms min=22.07ms med=599.01ms p(90)=1.78s   p(95)=2.43s   p(99)=3.09s    max=3.88s  
     http_reqs......................: 900     18.916485/s
     iteration_duration.............: avg=5.24s    min=2.71s   med=5.07s    p(90)=7.02s   p(95)=7.28s   p(99)=8.07s    max=8.1s   
     iterations.....................: 90      1.891648/s
     refresh_token_duration.........: avg=824.19ms min=42.37ms med=655.93ms p(90)=1.85s   p(95)=2.31s   p(99)=2.9s     max=3.2s   
     vus............................: 8       min=8          max=10
     vus_max........................: 10      min=10         max=10


running (47.6s), 00/10 VUs, 90 complete and 0 interrupted iterations
concurrent_refresh ✓ [ 100% ] 10 VUs  45s