loadtest-refresh-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest/k6/refresh_rotation.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 2m30s max duration (incl. graceful stop):
              * concurrent_refresh: 5 iterations shared among 5 VUs (maxDuration: 2m0s, gracefulStop: 30s)


running (0m01.0s), 2/5 VUs, 3 complete and 0 interrupted iterations
concurrent_refresh   [  60% ] 5 VUs  0m00.2s/2m0s  3/5 shared iters

     ✓ refresh status 200 or 400

     █ setup

       ✓ setup refresh token

     checks.........................: 100.00% 6 out of 6
     data_received..................: 13 kB   13 kB/s
     data_sent......................: 4.5 kB  4.3 kB/s
     http_req_blocked...............: avg=18.65ms  min=0s       med=21.2ms   max=80.01ms  p(90)=27.54ms  p(95)=53.78ms 
     http_req_connecting............: avg=17.09ms  min=0s       med=21.2ms   max=64.39ms  p(90)=25.98ms  p(95)=45.19ms 
     http_req_duration..............: avg=151.07ms min=30.88ms  med=114.71ms max=562.49ms p(90)=247.37ms p(95)=404.93ms
       { expected_response:true }...: avg=133.88ms min=30.88ms  med=43.18ms  max=562.49ms p(90)=324.86ms p(95)=443.68ms
     http_req_failed................: 40.00%  4 out of 10
     http_req_receiving.............: avg=2.08ms   min=0s       med=1.63ms   max=6.19ms   p(90)=5.05ms   p(95)=5.62ms  
     http_req_sending...............: avg=51.18µs  min=0s       med=0s       max=511.8µs  p(90)=51.17µs  p(95)=281.48µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=148.93ms min=29.35ms  med=113.15ms max=560.5ms  p(90)=245.61ms p(95)=403.06ms
     http_reqs......................: 10      9.659162/s
     iteration_duration.............: avg=180.82ms min=109.23ms med=168.06ms max=233.57ms p(90)=231.72ms p(95)=232.64ms
     iterations.....................: 5       4.829581/s
     vus............................: 2       min=2       max=2
     vus_max........................: 5       min=5       max=5


running (0m01.0s), 0/5 VUs, 5 complete and 0 interrupted iterations
concurrent_refresh ✓ [ 100% ] 5 VUs  0m00.2s/2m0s  5/5 shared iters